templates/product-data/version-2-0-0/get-product.xml

<?xml version='1.0' encoding='utf-8'?>
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
    <soap-env:Body>
        <ns0:GetProductRequest xmlns:ns0="http://www.promostandards.org/WSDL/ProductDataService/2.0.0/">
            <ns1:wsVersion xmlns:ns1="http://www.promostandards.org/WSDL/ProductDataService/2.0.0/SharedObjects/">
                {{wsVersion}}
            </ns1:wsVersion>
            <ns2:id xmlns:ns2="http://www.promostandards.org/WSDL/ProductDataService/2.0.0/SharedObjects/">{{username}}
            </ns2:id>
            <ns3:password xmlns:ns3="http://www.promostandards.org/WSDL/ProductDataService/2.0.0/SharedObjects/">
                {{password}}
            </ns3:password>
            <ns4:localizationCountry xmlns:ns4="http://www.promostandards.org/WSDL/ProductDataService/2.0.0/SharedObjects/">{{localizationCountry}}
            </ns4:localizationCountry>
            <ns5:localizationLanguage xmlns:ns5="http://www.promostandards.org/WSDL/ProductDataService/2.0.0/SharedObjects/">{{localizationLanguage}}
            </ns5:localizationLanguage>
            <ns6:productId xmlns:ns6="http://www.promostandards.org/WSDL/ProductDataService/2.0.0/SharedObjects/">
                {{productId}}
            </ns6:productId>
        </ns0:GetProductRequest>
    </soap-env:Body>
</soap-env:Envelope>

